Tekla Open API Reference for Tekla Structures 2025
RebarSet.RebarProperties Property
 Gets or sets the reinforcing bar properties for the rebar set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarProperties RebarProperties { get; set; }
Public Property RebarProperties As RebarProperties
	Get
	Set
Property Value
Type: RebarProperties
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace